tutorials/icoDyMFoam/mixerGgi/0/p
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    impellerWall    
    {
        type            zeroGradient;
    }

    baffleWall      
    {
        type            zeroGradient;
    }

    insideSlider    
    {
        type            ggi;
    }

    outsideSlider   
    {
        type            ggi;
    }

    defaultFaces    
    {
        type            empty;
    }
}


// ************************************************************************* //
