tutorials/icoDyMFoam/mixerGgi/system/fvSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
//     p                  BiCGStab
//                        {
//                            preconditioner
//                            {
//                                type          Cholesky;
//                            }

//                            minIter           0;
//                            maxIter           1000;
//                            tolerance         1e-8;
//                            relTol            0.01;
//                        };

//     pFinal             BiCGStab
//                        {
//                            preconditioner
//                            {
//                                type          Cholesky;
//                            }

//                            minIter           0;
//                            maxIter           1000;
//                            tolerance         1e-8;
//                            relTol            0.0;
//                        };
     p               ICCG 1e-06 0;
     pFinal          ICCG 1e-06 0;
//     pcorr           ICCG 1e-08 0;
    U                  smoothSolver
                       {
                           smoother          GaussSeidel;

                           nSweeps           5;
                           minIter           0;
                           maxIter           500;
                           tolerance         1e-8;
                           relTol            0.0;
                       };
}

PISO
{
    nCorrectors     4;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;
}


// ************************************************************************* //
